# Welcome to my class

In [1]:
# import pandas library
import pandas as pd

In [4]:
# create dataframe from scratch
data = {'apples':[2,1,4,3], 'bananas': [2,5,1,0]}
buying = pd.DataFrame(data)

In [5]:
buying

   apples  bananas
0       2        2
1       1        5
2       4        1
3       3        0

In [6]:
buying = pd.DataFrame(data,index=['Jane','Daniel','May','Jack'])

In [7]:
buying

        apples  bananas
Jane         2        2
Daniel       1        5
May          4        1
Jack         3        0

In [8]:
buying.loc['Jane'] # location for row

apples     2
bananas    2
Name: Jane, dtype: int64

In [11]:
buying.iloc[1]  #index for location for row

apples     1
bananas    5
Name: Daniel, dtype: int64

In [13]:
df = pd.DataFrame(buying,columns = ['apples','bananas'])
df.to_csv(r'buying.csv',index = True, header = True )

In [14]:
df = pd.read_csv('buying.csv')

In [15]:
df[['apples','bananas']]

   apples  bananas
0       2        2
1       1        5
2       4        1
3       3        0

In [16]:
df.head()

  Unnamed: 0  apples  bananas
0       Jane       2        2
1     Daniel       1        5
2        May       4        1
3       Jack       3        0

In [17]:
df['apples']

0    2
1    1
2    4
3    3
Name: apples, dtype: int64

In [18]:
df1 = pd.read_csv('1000_data.csv')

In [19]:
test = pd.read_csv('C:/Users/dz234/OneDrive/Desktop/Learning Process/Applied Data Science/100_initial.csv')

In [23]:
df1.head()

    country  age  weight  sleep before 10pm
0  Mongolia   61     100              False
1    Russia   38      77               True
2  Zimbabwe   32      69              False
3  Portugal   43      77               True
4    France   65      64              False

In [24]:
df1['country']

0      Mongolia
1        Russia
2      Zimbabwe
3      Portugal
4        France
         ...
995      Serbia
996      Brazil
997     Myanmar
998       Italy
999      Latvia
Name: country, Length: 1000, dtype: object

In [38]:
# concatenate two columns

df1['age_weight'] = df1.age.astype(str) +','+ df1.weight.astype(str)

In [39]:
# press shift+tab to see explanation on the functions 
# drop an attribute (column)
df1 = df1.drop('age_weight',axis = 1)

In [32]:
df1

      country  age  weight  sleep before 10pm
0    Mongolia   61     100              False
1      Russia   38      77               True
2    Zimbabwe   32      69              False
3    Portugal   43      77               True
4      France   65      64              False
..        ...  ...     ...                ...
995    Serbia   23      66               True
996    Brazil   53      79              False
997   Myanmar   39      46               True
998     Italy   62      41              False
999    Latvia   23      73              False

[1000 rows x 4 columns]

In [40]:
df1.age.sort_values(ascending=False)

293    70
963    70
947    70
76     70
806    70
       ..
196    15
602    15
608    15
90     15
460    15
Name: age, Length: 1000, dtype: int64

In [42]:
df1.sort_values('age',ascending=False)

                      country  age  weight  sleep before 10pm
293                   Germany   70      87               True
963            Czech Republic   70      89               True
947  Central African Republic   70      95               True
76           Papua New Guinea   70      52              False
806                Kazakhstan   70      66               True
..                        ...  ...     ...                ...
196            Czech Republic   15      40               True
602                     China   15      95              False
608                  Pakistan   15      72              False
90                      Spain   15      88               True
460                     China   15      63              False

[1000 rows x 4 columns]

In [44]:
df1.sort_values(['age','weight'])

                      country  age  weight  sleep before 10pm
196            Czech Republic   15      40               True
396                   Vietnam   15      43               True
277                 Indonesia   15      48              False
107               Philippines   15      50              False
77                   Portugal   15      54               True
..                        ...  ...     ...                ...
421               North Korea   70      88               True
963            Czech Republic   70      89               True
163                   Bolivia   70      92              False
801                     China   70      95              False
947  Central African Republic   70      95               True

[1000 rows x 4 columns]

In [45]:
# check the siz e
df1.shape

(1000, 4)

In [46]:
#check the type of data 
df1.dtypes

country              object
age                   int64
weight                int64
sleep before 10pm      bool
dtype: object

In [47]:
# check the attributes in CSV file 
df1.columns

Index(['country', 'age', 'weight', 'sleep before 10pm'], dtype='object')

In [48]:
df1.iloc[:,0]

0      Mongolia
1        Russia
2      Zimbabwe
3      Portugal
4        France
         ...
995      Serbia
996      Brazil
997     Myanmar
998       Italy
999      Latvia
Name: country, Length: 1000, dtype: object

In [49]:
df1.iloc[0:5,0]

0    Mongolia
1      Russia
2    Zimbabwe
3    Portugal
4      France
Name: country, dtype: object

In [52]:
df1.iloc[0:5,0::2]

    country  weight
0  Mongolia     100
1    Russia      77
2  Zimbabwe      69
3  Portugal      77
4    France      64

In [54]:
df1.iloc[:,2]

0      100
1       77
2       69
3       77
4       64
      ...
995     66
996     79
997     46
998     41
999     73
Name: weight, Length: 1000, dtype: int64

In [55]:
#Q2
x = df1.iloc[:,2]

In [57]:
x.head(10) #using head

0    100
1     77
2     69
3     77
4     64
5     48
6     70
7     75
8     40
9     61
Name: weight, dtype: int64

In [59]:
x.iloc[0:10] #using iloc to read first 10

0    100
1     77
2     69
3     77
4     64
5     48
6     70
7     75
8     40
9     61
Name: weight, dtype: int64

In [63]:
y = df1.iloc[[0,3,5],2]
y

0    100
3     77
5     48
Name: weight, dtype: int64